app/views/orders/show.html.erb

SELECT "items".* FROM "items" INNER JOIN "line_items" ON "items"."id" = "line_items"."item_id" WHERE "line_items"."cart_id" = $1  [["cart_id", 3]]
---
<p><%= @charity.user.name %></p>
<% @cart.items.each do |item| %>