app/views/carts/show.html.erb

SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = $1  [["cart_id", 3]]
---
<h1>My cart</h1>
<% @current_cart.line_items.each do |line_item| %>