app/views/items/_form.html.erb

SELECT "categories".* FROM "categories"  ORDER BY name
---
      <%= f.label :category %>
      <%= collection_select(:item, :category_id, Category.order('name'), :id, :name) %>