app/controllers/admin_controller.rb

	def index
		@admin = Admin.find_by(user_id: params[:id])
		@users = User.all
		@items = Item.all
		@orders = Order.all
---
SELECT  "admins".* FROM "admins" WHERE "admins"."user_id" = $1 LIMIT 1  [["user_id", 405]]
SELECT  "users".* FROM "users" LIMIT 1
SELECT "items".* FROM "items"
SELECT "orders".* FROM "orders"