app/controllers/admin_controller.rb

	def index
		@admin = Admin.all.first
---
SELECT  "admins".* FROM "admins"  ORDER BY "admins"."id" ASC LIMIT 1