app/controllers/carts_controller.rb

SELECT  "carts".* FROM "carts" WHERE "carts"."id" = $1 LIMIT 1  [["id", 3]]
---
    def show
        @current_cart = Cart.find(session[:cart_id])