app/controllers/items_controller.rb

	def create
		@item = Item.new(item_params)

		if @item.save
---
INSERT INTO "items" ("title", "inventory", "description", "business_id", "category_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

	def update
    	@item = Item.find(params[:id])
---
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", 385]]