app/controllers/line_items_controller.rb

INSERT INTO "carts" ("charity_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["charity_id", 145], ["created_at", "2015-12-06 03:38:31.052933"], ["updated_at", "2015-12-06 03:38:31.052933"]]
SELECT  "carts".* FROM "carts" WHERE "carts"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", 260]]
UPDATE "line_items" SET "quantity" = $1, "updated_at" = $2 WHERE "line_items"."id" = $3  [["quantity", 1], ["updated_at", "2015-12-06 03:38:31.358312"], ["id", 8]]
---
  def create

        unless session[:cart_id]
            cart = Cart.create
            session[:cart_id] = cart.id
        end
        cart = Cart.find(session[:cart_id])
        item = Item.find(params[:item_id])
        cart.add_item(item.id)
        cart.save