app/controllers/orders_controller.rb

	def index
		@user = User.find(session[:user_id])
		@orders = @user.charity.orders
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 372]]
SELECT  "charities".* FROM "charities" WHERE "charities"."user_id" = $1 LIMIT 1  [["user_id", 406]]

	def create
		@user = User.find(session[:user_id])
		@charity = @user.charity
		@cart = Cart.where(charity_id: @charity.id).last
		@order = Order.create_from_cart(@cart, @charity)

		if @order
           @cart_items = []
            @cart.items.each do |item|
            	@cart_items << item.title
        	end

            respond_to do |format|
	            # Tell the UserMailer to send a welcome email after save
	            UserMailer.order_email(@user,@cart_items).deliver_later

	            format.html { redirect_to(@user, notice: 'Your order was confirmed.') }
	            format.json { render json: @user, status: :created, location: @user }
         	end
         	@cart.checkout(@order)
	        session.delete(:cart_id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 295]]
SELECT  "carts".* FROM "carts" WHERE "carts"."charity_id" = $1 LIMIT 1  [["charity_id", 145]]
INSERT INTO "orders" ("id", "cart_id", "charity_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["id", 4], ["cart_id", 4], ["charity_id", 151], ["created_at", "2015-12-06 04:26:36.696884"], ["updated_at", "2015-12-06 04:26:36.696884"]]
SELECT "items".* FROM "items" INNER JOIN "line_items" ON "items"."id" = "line_items"."item_id" WHERE "line_items"."cart_id" = $1  [["cart_id", 15]]
SELECT  "charities".* FROM "charities" WHERE "charities"."user_id" = $1 LIMIT 1  [["user_id", 295]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 AND "orders"."cart_id" = $2 AND "orders"."charity_id" = 151 LIMIT 1  [["id", 4], ["cart_id", 4]]
DELETE FROM "carts" WHERE "carts"."id" = $1  [["id", 5]]

	def show
		@user = User.find(session[:user_id])
		@orders = @user.charity.orders
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 295]]
SELECT  "charities".* FROM "charities" WHERE "charities"."user_id" = $1 LIMIT 1  [["user_id", 295]]