app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "address", "zip", "phone", "city", "state", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
INSERT INTO "businesses" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 273], ["created_at", "2015-12-05 05:36:18.130170"], ["updated_at", "2015-12-05 05:36:18.130170"]]
INSERT INTO "charities" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 261], ["created_at", "2015-12-05 05:26:35.721277"], ["updated_at", "2015-12-05 05:26:35.721277"]]
---
	def create
		organization = params[:organization]
     if @omni_user = GoogleOmniauthTable.find_by(id: session[:user_id])
     	  @user = User.new(name: @omni_user.name, email: @omni_user.email)
        @user.phone = user_params[:phone]
        @user.address = user_params[:address]
        @user.city = user_params[:city]
        @user.state = user_params[:state]
        @user.zip = user_params[:zip]
        @user.password_digest = @omni_user.oauth_token
     else
	    @user = User.new(user_params)
    end
	    if @user.save
	    	 session[:user_id] = @user.id
		     if @omni_user
			    	 @omni_user.user = @user
			    	 @omni_user.save
		     end
	       @user.create_business_or_charity(@user, organization)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 295]]
UPDATE "users" SET "city" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["city", "Argentina"], ["updated_at", "2015-12-06 02:52:19.935378"], ["id", 295]]
---
	def update
		@user = User.find_by_id(params[:id])
		@user.update_attributes(user_params)